cmsis-svd/cmsis-svd/data/Microchip/ATSAMR30.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TAL</name>
      <version>1.0.2</version>
      <description>Trigger Allocator</description>
      <groupName>TAL</groupName>
      <prependToName>TAL_</prependToName>
      <baseAddress>0x40002C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TAL_INTREQ</name>
        <value>0</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RSTCTRL</name>
          <description>Reset Control</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
        </register>
        <register>
          <name>EXTCTRL</name>
          <description>External Break Control</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Enable BRK Pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>INV</name>
              <description>Invert BRK Pin</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCTRL</name>
          <description>Event Control</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BRKEI</name>
              <description>Break Input Event Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>BRKEO</name>
              <description>Break Output Event Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BRK</name>
              <description>Break Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BRK</name>
              <description>Break Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BRK</name>
              <description>Break</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>GLOBMASK</name>
          <description>Global Break Requests Mask</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Master</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVBRK</name>
              <description>Event Break Master</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>HALT</name>
          <description>Debug Halt Request</description>
          <addressOffset>0x0C</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Master</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVBRK</name>
              <description>Event Break Master</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>RESTART</name>
          <description>Debug Restart Request</description>
          <addressOffset>0x0D</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Master</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>BRKSTATUS</name>
          <description>Break Request Status</description>
          <addressOffset>0x0E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Request</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Request</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EVBRK</name>
              <description>Event Break Request</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Request</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>CTICTRLA%s</name>
          <description>Cross-Trigger Interface n Control A</description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ACTION</name>
              <description>Action when global break issued</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>ACTIONSelect</name>
                <enumeratedValue>
                  <name>BREAK</name>
                  <description>Break when requested</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INTERRUPT</name>
                  <description>Trigger DBG interrupt instead of break</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IGNORE</name>
                  <description>Ignore break request</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RESTART</name>
              <description>Action when global restart issued</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x2</dimIncrement>
          <name>CTIMASK%s</name>
          <description>Cross-Trigger Interface n Mask</description>
          <addressOffset>0x11</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>CM0P</name>
              <description>CM0P Break Master</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PPP</name>
              <description>PPP Break Master</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EVBRK</name>
              <description>Event Break Master</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTBRK</name>
              <description>External Break Master</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>29</dim>
          <dimIncrement>0x1</dimIncrement>
          <name>INTSTATUS%s</name>
          <description>Interrupt n Status</description>
          <addressOffset>0x20</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>IRQ0</name>
              <description>Interrupt Status for Interrupt Request 0 within Interrupt n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ1</name>
              <description>Interrupt Status for Interrupt Request 1 within Interrupt n</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ2</name>
              <description>Interrupt Status for Interrupt Request 2 within Interrupt n</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ3</name>
              <description>Interrupt Status for Interrupt Request 3 within Interrupt n</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ4</name>
              <description>Interrupt Status for Interrupt Request 4 within Interrupt n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ5</name>
              <description>Interrupt Status for Interrupt Request 5 within Interrupt n</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ6</name>
              <description>Interrupt Status for Interrupt Request 6 within Interrupt n</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQ7</name>
              <description>Interrupt Status for Interrupt Request 7 within Interrupt n</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACPUSEL0</name>
          <description>DMA Channel Interrupts CPU Select 0</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0</name>
              <description>DMA Channel 0 Interrupt CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1</name>
              <description>DMA Channel 1 Interrupt CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2</name>
              <description>DMA Channel 2 Interrupt CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3</name>
              <description>DMA Channel 3 Interrupt CPU Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4</name>
              <description>DMA Channel 4 Interrupt CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5</name>
              <description>DMA Channel 5 Interrupt CPU Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6</name>
              <description>DMA Channel 6 Interrupt CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7</name>
              <description>DMA Channel 7 Interrupt CPU Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH8</name>
              <description>DMA Channel 8 Interrupt CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH9</name>
              <description>DMA Channel 9 Interrupt CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH10</name>
              <description>DMA Channel 10 Interrupt CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH11</name>
              <description>DMA Channel 11 Interrupt CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH12</name>
              <description>DMA Channel 12 Interrupt CPU Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH13</name>
              <description>DMA Channel 13 Interrupt CPU Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH14</name>
              <description>DMA Channel 14 Interrupt CPU Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH15</name>
              <description>DMA Channel 15 Interrupt CPU Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>EVCPUSEL0</name>
          <description>EVSYS Channel Interrupts CPU Select 0</description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CH0</name>
              <description>Event Channel 0 Interrupt CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH1</name>
              <description>Event Channel 1 Interrupt CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH2</name>
              <description>Event Channel 2 Interrupt CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH3</name>
              <description>Event Channel 3 Interrupt CPU Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH4</name>
              <description>Event Channel 4 Interrupt CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH5</name>
              <description>Event Channel 5 Interrupt CPU Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH6</name>
              <description>Event Channel 6 Interrupt CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH7</name>
              <description>Event Channel 7 Interrupt CPU Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH8</name>
              <description>Event Channel 8 Interrupt CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH9</name>
              <description>Event Channel 9 Interrupt CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH10</name>
              <description>Event Channel 10 Interrupt CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CH11</name>
              <description>Event Channel 11 Interrupt CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
