cmsis-svd/cmsis-svd/data/Microchip/ATSAMR30.svd
        <register>
          <name>EICCPUSEL0</name>
          <description>EIC External Interrupts CPU Select 0</description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>EXTINT0</name>
              <description>External Interrupt 0 CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT1</name>
              <description>External Interrupt 1 CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT2</name>
              <description>External Interrupt 2 CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT3</name>
              <description>External Interrupt 3 CPU Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT4</name>
              <description>External Interrupt 4 CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT5</name>
              <description>External Interrupt 5 CPU Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT6</name>
              <description>External Interrupt 6 CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT7</name>
              <description>External Interrupt 7 CPU Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT8</name>
              <description>External Interrupt 8 CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT9</name>
              <description>External Interrupt 9 CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT10</name>
              <description>External Interrupt 10 CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT11</name>
              <description>External Interrupt 11 CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT12</name>
              <description>External Interrupt 12 CPU Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT13</name>
              <description>External Interrupt 13 CPU Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT14</name>
              <description>External Interrupt 14 CPU Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTINT15</name>
              <description>External Interrupt 15 CPU Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCPUSEL0</name>
          <description>Interrupts CPU Select 0</description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SYSTEM</name>
              <description>SYSTEM Interrupt CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT</name>
              <description>WDT Interrupt CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTC</name>
              <description>RTC Interrupt CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVMCTRL</name>
              <description>NVMCTRL Interrupt CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>USB</name>
              <description>USB Interrupt CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM0</name>
              <description>SERCOM0 Interrupt CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM1</name>
              <description>SERCOM1 Interrupt CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM2</name>
              <description>SERCOM2 Interrupt CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM3</name>
              <description>SERCOM3 Interrupt CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM4</name>
              <description>SERCOM4 Interrupt CPU Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SERCOM5</name>
              <description>SERCOM5 Interrupt CPU Select</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC0</name>
              <description>TCC0 Interrupt CPU Select</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TCC1</name>
              <description>TCC1 Interrupt CPU Select</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTCPUSEL1</name>
          <description>Interrupts CPU Select 1</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>TCC2</name>
              <description>TCC2 Interrupt CPU Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC0</name>
              <description>TC0 Interrupt CPU Select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC1</name>
              <description>TC1 Interrupt CPU Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC2</name>
              <description>TC2 Interrupt CPU Select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC3</name>
              <description>TC3 Interrupt CPU Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TC4</name>
              <description>TC4 Interrupt CPU Select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADC</name>
              <description>ADC Interrupt CPU Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AC</name>
              <description>AC Interrupt CPU Select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DAC</name>
              <description>DAC Interrupt CPU Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PTC</name>
              <description>PTC Interrupt CPU Select</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AES</name>
              <description>AES Interrupt CPU Select</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TRNG</name>
              <description>TRNG Interrupt CPU Select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PICOP</name>
              <description>PICOP Interrupt CPU Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IRQTRIG</name>
          <description>Interrupt Trigger</description>
          <addressOffset>0x60</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Trigger Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IRQNUM</name>
              <description>Interrupt Request Number</description>
              <bitOffset>1</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>OVERRIDE</name>
              <description>Interrupt Request Override Value</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CPUIRQS%s</name>
          <description>Interrupt Status for CPU n</description>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CPUIRQS</name>
              <description>Interrupt Requests for CPU n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>29</bitWidth>
            </field>
          </fields>
        </register>
