cmsis-svd/cmsis-svd/data/Microchip/ATSAMR30.svd
        <register>
          <name>PER_DITH6</name>
          <description>Period</description>
          <alternateRegister>PER</alternateRegister>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s</name>
          <description>Compare and Capture</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s_DITH4</name>
          <description>Compare and Capture</description>
          <alternateRegister>CC%s</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s_DITH5</name>
          <description>Compare and Capture</description>
          <alternateRegister>CC%s</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s_DITH6</name>
          <description>Compare and Capture</description>
          <alternateRegister>CC%s</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PATTBUF</name>
          <description>Pattern Buffer</description>
          <addressOffset>0x64</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PGEB0</name>
              <description>Pattern Generator 0 Output Enable Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB1</name>
              <description>Pattern Generator 1 Output Enable Buffer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB2</name>
              <description>Pattern Generator 2 Output Enable Buffer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB3</name>
              <description>Pattern Generator 3 Output Enable Buffer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB4</name>
              <description>Pattern Generator 4 Output Enable Buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB5</name>
              <description>Pattern Generator 5 Output Enable Buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB6</name>
              <description>Pattern Generator 6 Output Enable Buffer</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB7</name>
              <description>Pattern Generator 7 Output Enable Buffer</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB0</name>
              <description>Pattern Generator 0 Output Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB1</name>
              <description>Pattern Generator 1 Output Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB2</name>
              <description>Pattern Generator 2 Output Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB3</name>
              <description>Pattern Generator 3 Output Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB4</name>
              <description>Pattern Generator 4 Output Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB5</name>
              <description>Pattern Generator 5 Output Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB6</name>
              <description>Pattern Generator 6 Output Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB7</name>
              <description>Pattern Generator 7 Output Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUF</name>
          <description>Period Buffer</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PERBUF</name>
              <description>Period Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUF_DITH4</name>
          <description>Period Buffer</description>
          <alternateRegister>PERBUF</alternateRegister>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PERBUF</name>
              <description>Period Buffer Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUF_DITH5</name>
          <description>Period Buffer</description>
          <alternateRegister>PERBUF</alternateRegister>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PERBUF</name>
              <description>Period Buffer Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUF_DITH6</name>
          <description>Period Buffer</description>
          <alternateRegister>PERBUF</alternateRegister>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PERBUF</name>
              <description>Period Buffer Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCBUF%s</name>
          <description>Compare and Capture Buffer</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CCBUF</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCBUF%s_DITH4</name>
          <description>Compare and Capture Buffer</description>
          <alternateRegister>CCBUF%s</alternateRegister>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CCBUF</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCBUF%s_DITH5</name>
          <description>Compare and Capture Buffer</description>
          <alternateRegister>CCBUF%s</alternateRegister>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CCBUF</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCBUF%s_DITH6</name>
          <description>Compare and Capture Buffer</description>
          <alternateRegister>CCBUF%s</alternateRegister>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CCBUF</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
